{
  "initials": "ac",
  "layout": "resume",
  "type": "person",
  "role": "associate",
  "lastname": "Chandrasekharan",
  "firstname": "Arun",
  "cvVersion": "v2025b",
  "email": "arun.chandrasekharan@desgouttes.ch",
  "phone": "+41 22 704 30 50",
  "languages": [
    "en",
    "de_ch",
    "fr",
    "it"
  ],
  "activities": [
    "Partner",
    "Attorney at Law",
    "Deputy Secretary of the Supervisory Board CDB",
    "Former Member of the Board of the Geneva Bar Association"
  ],
  "memberships": [
    "Geneva Bar Association (OdA)",
    "Swiss Bar Association (SAV)",
    "International Fraud Group (IFG)"
  ],
  "expertiseDomains": [
    {
      "expertise": "Arun Chandrasekharan is a partner and a recognized expert in all aspects of commercial contracts, litigation and arbitration, and employment law matters."
    },
    {
      "practiceArea": "commercial-contracts",
      "expertise": "Arun advises, negotiates, drafts and resolves disputes related to service contracts, such as distribution, joint venture, licensing, outsourcing agreements, manufacturing, supply, management, and employment agreements or general consulting contracts both in international and domestic relations."
    },
    {
      "practiceArea": "corporate",
      "expertise": "Arun assists clients on transactions concerning the sale of companies or assets (including real estate transactions), investment in companies, and transfer of technologies. He advises, negotiates, drafts and resolves disputes pertaining to banking matters (loan agreements, asset management, trade finance, etc.), shareholders' agreements, share or asset purchase agreements, investment agreements, convertible loan agreements and related agreements.\n\nWith his own personal experience on Boards of Directors, Arun regularly handles issues of corporate law including corporate housekeeping and corporate restructuring."
    },
    {
      "practiceArea": "litigation-arbitration",
      "expertise": "Arun is an expert in dispute resolutions both before courts in Geneva and other cantons as well as in arbitration and mediation. He regularly acts as sole arbitrator, party appointed arbitrator and mediator both in ad hoc proceedings as well as in institutional arbitrations (International Chamber of Commerce, Swiss Arbitration Center, Arbitral Tribunal of the Swiss Association of Asset"
    },
    {
      "practiceArea": "employment-immigration",
      "expertise": "Arun is an expert in employment and immigration law. His practice focuses on the negotiation and drafting of employment agreements, bonus and incentive schemes, termination (individual or mass) agreements, and social plans. He furthermore represents both companies and employees in managerial positions in front of labor courts, in all industry sectors with a focus on the banking industry."
    }
  ],
  "education": [
    {
      "date": "1995",
      "content": "Mathematisch-Naturwissenschaftliches Gymnasium Rämibühl, Zurich, Matura"
    },
    {
      "date": "1998",
      "content": "University of Geneva, licence en droit"
    },
    {
      "date": "2000",
      "content": "Geneva Bar Exam (ranked 2nd best)"
    }
  ],
  "experience": [
    {
      "title": "Law Firms",
      "experience": [
        {
          "date": "1998",
          "content": "Joined Des Gouttes & Associés"
        },
        {
          "date": "2002",
          "content": "Partner, Des Gouttes & Associés"
        }
      ]
    },
    {
      "title": "Independent Board Memberships",
      "experience": [
        {
          "date": "2002-2004",
          "content": "Member of the Board of Directors of Imtix Sangstat (Switzerland) GmbH"
        },
        {
          "date": "2015-2021",
          "content": "Member of the Board of Directors of the Geneva Bar Association"
        },
        {
          "date": "2010",
          "content": "Member of the Board of Directors of SI Domaine du Parc SA"
        },
        {
          "date": "2014",
          "content": "Member of the Board of Directors of Dynawealth Management Ltd."
        }
      ]
    },
    {
      "title": "Other Activities",
      "experience": [
        {
          "date": "2018",
          "content": "Member of the <i>Commission en matière d'honoraires d'avocat</i>"
        },
        {
          "date": "2019",
          "content": "Vice-President of the ADR Commission of the Geneva Bar Association"
        },
        {
          "date": "2021",
          "content": "Deputy Secretary of the Supervisory Board CDB"
        }
      ]
    }
  ],
  "id": "AC",
  "admin": {
    "password": "$2a$10$OLt4g9Ft2.v1TtRyGM3IrO7bbOm8IO/YcwJlZhE05gU45//XWvqLG",
    "salt": "35610e17-7c2a-43de-b263-6142f91bee48"
  }
}
