{
  "initials": "ac",
  "layout": "resume",
  "type": "person",
  "role": "associate",
  "lastname": "Chandrasekharan",
  "firstname": "Arun",
  "cvVersion": "v2023",
  "email": "arun.chandrasekharan@desgouttes.ch",
  "phone": "+41 22 704 30 50",
  "languages": [
    "en",
    "de_ch",
    "fr",
    "it"
  ],
  "activities": [
    "Partner",
    "Deputy Secretary of the Supervisory Board CDB",
    "Former Member of the Board of the Geneva Bar Association",
    "Attorney at Law"
  ],
  "memberships": [
    "Geneva Bar Association (OdA)",
    "Swiss Bar Association (SAV)",
    "International Fraud Group (IFG)"
  ],
  "expertiseDomains": [
    {
      "practiceArea": "corporate-contracts",
      "expertise": "Arun Chandrasekharan primarily advises, negotiates, drafts and resolves disputes related to service contracts, such as mandate agreements, distribution agreements, joint venture agreements, licensing agreements, outsourcing agreements, manufacturing agreements, supply agreements, management agreements, employment agreements or general consulting contracts both in international and domestic relations.\n\nHe assists clients on transactions concerning the sale of companies or assets (including real estate transactions), investment in companies, transfer of technologies. He advises, negotiates, drafts and resolves disputes pertaining banking matters (loan agreements, asset management, trade finance, etc.), shareholders' agreements, share or asset purchase agreements, investment agreements, convertible loan agreements and related agreements.\n\nWith his own personal experience on Boards of Directors, Arun regularly handles issues of corporate law including corporate housekeeping and corporate restructuring."
    },
    {
      "practiceArea": "litigation-arbitration",
      "expertise": "Arun Chandrasekharan disposes of a vast experience in dispute resolutions both before courts in Geneva and other cantons as well as in arbitration and mediation. He regularly acts as sole arbitrator, party appointed arbitrator and mediator both in ad hoc proceedings as well as in institutional arbitrations/mediations (International Chamber of Commerce, Swiss Arbitration Centre, Arbitral Tribunal of the Swiss Association of Asset Managers)."
    },
    {
      "practiceArea": "insolvency-restructuring",
      "title": "Enforcement",
      "expertise": "Arun Chandrasekharan regularly ensures the enforcement of foreign and national decisions and clients' rights by means of civil seizure of assets, criminal proceedings on behalf of financially harmed clients or recognition proceedings. He is a member of the International Fraud Group."
    }
  ],
  "education": [
    {
      "date": "1998",
      "content": "University of Geneva, licence en droit"
    },
    {
      "date": "2000",
      "content": "Geneva Bar Exam (ranked 2nd best)"
    }
  ],
  "experience": [
    {
      "date": "1998-2000",
      "content": "Trainee Lawyer, Des Gouttes & Associés"
    },
    {
      "date": "2001-2002",
      "content": "Associate, Des Gouttes & Associés"
    },
    {
      "date": "2002",
      "content": "Partner, Des Gouttes & Associés"
    }
  ],
  "others": [
    {
      "date": "2002-2004",
      "content": "Member of the Board of Directors of Imtix Sangstat (Switzerland) GmbH"
    },
    {
      "date": "2015-2021",
      "content": "Member of the Board of Directors of the Geneva Bar Association"
    },
    {
      "date": "Since 2010",
      "content": "Member of the Board of Directors of SI Domaine du Parc SA"
    },
    {
      "date": "Since 2014",
      "content": "Member of the Board of Directors of Dynawealth Management Ltd."
    },
    {
      "date": "Since 2018",
      "content": "Member of the _Commission en matière d'honoraires d'avocat_"
    },
    {
      "date": "Since 2019",
      "content": "Vice-President of the ADR Commission of the Geneva Bar Association"
    },
    {
      "date": "Since 2021",
      "content": "Deputy Secretary of the Supervisory Board CDB"
    }
  ],
  "id": "AC",
  "admin": {
    "password": "$2a$10$OLt4g9Ft2.v1TtRyGM3IrO7bbOm8IO/YcwJlZhE05gU45//XWvqLG",
    "salt": "35610e17-7c2a-43de-b263-6142f91bee48"
  }
}
