{
  "initials": "cr",
  "layout": "resume",
  "type": "person",
  "role": "associate",
  "lastname": "Reyes",
  "firstname": "Carla",
  "cvVersion": "v2024",
  "email": "carla.reyes@desgouttes.ch",
  "phone": "+41 22 704 30 50",
  "languages": [
    "en",
    "fr",
    "sp",
    "it"
  ],
  "activities": [
    "Partner",
    "Attorney at Law, LL.M."
  ],
  "memberships": [
    "Geneva Bar Association (OdA)",
    "Swiss Bar Association (SAV)",
    "European Criminal Bar Association (ECBA)",
    "European Fraud and Compliance Lawyers (EFCL)",
    "Women’s Business Society (WBS)",
    "Victims of Crime Association of Lawyers (VOCAL)",
    "International Fraud Group (IFG)",
    "Women's White Collar Defense Association (WWCDA)"
  ],
  "expertiseDomains": [
    {
      "practiceArea": "fraud-financial-crime-assets-recovery",
      "expertise": "Carla Reyes' primary fields of practice are complex fraud matters, business crime, international mutual legal assistance (criminal, administrative and tax related), extradition, as well as compliance and regulatory.\n\nShe is frequently retained as counsel in connection with white-collar crime cases at a federal or state level.\n\nShe regularly handles issues related to corporate investigations and assists clients in settlement negotiations.\n\nCarla Reyes regularly ensures the enforcement of foreign and national decisions and clients' rights by means of criminal proceedings, asset tracing and recovery, as well as civil seizure of assets on behalf of financially harmed clients.\n\nWWL says: Carla Reyes _is a leading white-collar crime lawyer, whom peers endorse as \"a formidable advocate and excellent lawyer\"._ She further _\"is an excellent strategist and has the highest legal skills\", \"Definitely my go-to person in Switzerland\"._"
    },
    {
      "practiceArea": "litigation-arbitration",
      "expertise": "Carla Reyes has a broad practice across the spectrum of criminal and commercial litigation both before state courts and other Swiss federal jurisdictions. In particular, she enjoys considerable experience in domestic and cross-border multi-jurisdictional litigation matters.\n\nShe practices, among others, in international commercial disputes of a civil nature, in particular in the banking and trading industry."
    },
    {
      "title": "International Sanctions",
      "expertise": "Carla Reyes has also developed a strong practice before the Federal authorities in embargoes, sanctions matters and political freezing of assets."
    }
  ],
  "education": [
    {
      "date": "2005",
      "content": "University of Geneva, Licence en droit (magna cum laude)"
    },
    {
      "date": "2009",
      "content": "Admission to the Geneva Bar"
    },
    {
      "date": "2010",
      "content": "Columbia University School of Law, New York, LL.M."
    },
    {
      "date": "2011",
      "content": "Admission to the New York Bar"
    }
  ],
  "experience": [
    {
      "date": "2010-2011",
      "content": "Foreign Lawyer, Wachtel Missry LLP, New York"
    },
    {
      "date": "2011-2016",
      "content": "Senior Associate, Schellenberg Wittmer Ltd., Geneva"
    },
    {
      "date": "2017",
      "content": "Partner, Des Gouttes & Associés"
    }
  ],
  "others": [
    {
      "date": "2016-2020",
      "content": "Member of the Board of Directors of the Women’s Business Society (WBS)"
    },
    {
      "date": "2016-2020",
      "content": "Member of the Commission for the Innovation and Modernization of the Geneva Bar (CIMBAR)"
    },
    {
      "date": "2018",
      "content": "Member of the Board of Directors of Victims of Crime Association of Lawyers (VOCAL), Vice-President since 2024"
    },
    {
      "date": "2020",
      "content": "Member of the Advisory Board of  European Criminal Bar Association (ECBA)"
    }
  ]
}
