{
  "initials": "LH",
  "layout": "resume",
  "type": "person",
  "role": "associate",
  "lastname": "Hawa",
  "firstname": "Leila",
  "cvVersion": "v2025b",
  "email": "leila.hawa@desgouttes.ch",
  "phone": "+41 22 704 30 50",
  "languages": [
    "fr",
    "en",
    "de",
    "Italian (spoken)"
  ],
  "activities": [
    "Partner",
    "Attorney at Law, LL.M.",
    "Independent Board Member"
  ],
  "memberships": [
    "Geneva Bar Association (OdA)",
    "Swiss Bar Association (SAV)",
    "Swiss Institute of Directors (SIoD)",
    "Swiss Board Network"
  ],
  "expertiseDomains": [
    {
      "expertise": "Leila Hawa is a partner and an expert in corporate law, M&A, real estate and financing transactions."
    },
    {
      "practiceArea": "ma-private-equity-venture-capital",
      "expertise": "Leila is experienced in international and domestic transactions, including mergers and acquisitions (share as well as asset deals), private equity buy-outs, venture capital financing rounds, and transactional real estate matters for listed and non-listed companies across a wide range of industries such as IT, new technologies, gas, luxury goods, banking, insurance, hotel business, and real estate."
    },
    {
      "practiceArea": "banking-finance",
      "expertise": "Leila regularly advises clients on the structuring, negotiation and implementation of financing arrangements such as corporate lending transactions (including syndicated lending), leveraged acquisition and buy-out finance, convertible debt financing, asset- backed debt financing, real estate financing, and recapitalizations. She regularly advises Swiss and international investors, borrowers and lenders."
    },
    {
      "practiceArea": "corporate",
      "expertise": "Leila is an expert on corporate law matters including complex equity financing for privately held companies, shareholders' agreements, shareholders' meetings and corporate governance matters, and setting up of business in Switzerland. She acts for both institutional clients and large families."
    },
    {
      "practiceArea": "commercial-contracts",
      "expertise": "Leila advises on the negotiation and drafting of complex commercial contracts (umbrella and service level agreements, manufacturing, supply, distribution, and licensing, as well as employment and mandate agreements) both in international and domestic matters. She further advises clients on the structuring and implementation of stock option and stock purchase plans."
    },
    {
      "practiceArea": "real-estate",
      "expertise": "She advises both private and institutional clients on real estate law, including purchases, sales, structuring and financing, as well as administrative law matters (licenses, restrictions on acquisitions). Leila also sits on the investment committee of a pension fund."
    }
  ],
  "education": [
    {
      "date": "1998",
      "content": "Universities of Geneva and Basel, Licence en droit"
    },
    {
      "date": "2000",
      "content": "Admission to the Geneva Bar"
    },
    {
      "date": "2002",
      "content": "Columbia University, School of Law, New York, LL.M."
    },
    {
      "date": "2018",
      "content": "University of St. Gallen / HEC Lausanne / Swiss Board Institute, Executive Program for Board Members"
    }
  ],
  "experience": [
    {
      "title": "Law Firms",
      "experience": [
        {
          "date": "2002-2009",
          "content": "Senior Associate, Lenz & Staehelin, Geneva and Zurich"
        },
        {
          "date": "2010",
          "content": "Partner, Des Gouttes & Associés, Geneva"
        }
      ]
    },
    {
      "title": "Independent Board Memberships",
      "experience": [
        {
          "date": "2021",
          "content": "Board member and member of the investment committee, La Collective de prévoyance - COPRÉ, Geneva"
        }
      ]
    }
  ],
  "id": "LH",
  "admin": {
    "password": "$2a$10$Sj3W2Wy3q2GhOWixOlKbKeZVjgM7/kK48MmC7GKI3OA/dmz6.dWEi",
    "salt": "ac6c73d7-f471-4a41-a13a-728711c20871"
  }
}
