{
  "initials": "SL",
  "layout": "resume",
  "type": "person",
  "role": "attorney",
  "lastname": "Lombardi",
  "firstname": "Stéphanie",
  "cvVersion": "v2025b",
  "email": "stephanie.lombardi@desgouttes.ch",
  "phone": "+41 22 704 30 50",
  "languages": [
    "fr",
    "en",
    "sp",
    "it",
    "de"
  ],
  "activities": [
    "Associate",
    "Attorney at Law"
  ],
  "memberships": [
    "Geneva Bar Association (OdA)",
    "Swiss Bar Association (SAV)"
  ],
  "expertiseDomains": [
    {
      "practiceArea": "litigation-arbitration",
      "expertise": "Stéphanie Lombardi advises and represents private and corporate clients in domestic and international litigation and arbitration, in civil and commercial disputes.\n\n She ensures the enforcement of foreign and national decisions and arbitral awards, in particular by means of civil seizure of assets and recognition proceedings."
    },
    {
      "practiceArea": "commercial-contracts",
      "expertise": "Stéphanie advises entrepreneurs, companies and private clients on the negotiation and drafting in a national and international scope of all types of commercial contracts, including manufacturing, distribution, licensing, sponsoring, joint venture, franchise, non-disclosure, lease, service, sale and purchase agreements."
    },
    {
      "practiceArea": "corporate",
      "expertise": "Stéphanie assists clients with corporate law matters that arise during the business life of their company, from the incorporation to the sale."
    },
    {
      "practiceArea": "employment-immigration",
      "expertise": "Stéphanie advises and represents Swiss and multinational clients in all matters relating to employment law, including negotiation, drafting and review of employment contracts, termination agreements, bonus scheme, non-compete and non-solicit provisions. She further advises clients on their internal policies and assists them with the preparation and enforcement of individual and collective dismissals.\n\n She also regularly assists individuals in obtaining residence and work permits and companies with the transfer and secondment of employees."
    }
  ],
  "education": [
    {
      "date": "2018",
      "content": "University of Geneva, Bachelor of Law"
    },
    {
      "date": "2019",
      "content": "University of Geneva, Certificate in Transnational Law"
    },
    {
      "date": "2020",
      "content": "University of Geneva, Master of Law (Mobility, University of Zurich)"
    },
    {
      "date": "2020",
      "content": "University of Geneva, Certificate of Advanced Studies in Legal Professions"
    },
    {
      "date": "2023",
      "content": "Admission to the Geneva Bar"
    }
  ],
  "experience": [
    {
      "date": "2018-2019",
      "content": "Trainee, Department of Private International Law, University of Geneva"
    },
    {
      "date": "2021-2023",
      "content": "Trainee Lawyer, Mentha Avocats, Geneva"
    },
    {
      "date": "2023",
      "content": "Associate, Des Gouttes & Associés"
    }
  ],
  "others": []
}
